Тестовая_база_ERP_14/src/Catalogs/РЭЙ_Файлы/РЭЙ_Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РЭЙ_Файлы</name>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <comment>Полное наименование (длиной до 256 символов)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла версии</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле только для обмена файлами</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектВладелец</name>
    <type>
      <types>DocumentRef.РЭЙ_СправкаОВалютныхОперациях</types>
      <types>DocumentRef.РЭЙ_СправкаОПодтверждающихДокументах</types>
      <types>DocumentRef.РЭЙ_ПаспортСделки</types>
      <types>DocumentRef.РЭЙ_ЗаявлениеВБанкПС</types>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Enums/ТипыХраненияФайлов/ТипыХраненияФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыХраненияФайлов</name>
  <enumValues>
    <name>ВИнформационнойБазе</name>
  </enumValues>
  <enumValues>
    <name>ВТомахНаДиске</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Catalogs/РЭЙ_Файлы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФайлИзменен = Ложь;
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Если Объект.ТипХраненияФайла = ПредопределенноеЗначение("Перечисление.ТипыХраненияФайлов.ВИнформационнойБазе") Тогда
			АдресФайла = Параметры.АдресВременногоХранилища;
			ФайлИзменен = Истина;
		Иначе
			Объект.ПутьКФайлу = Параметры.ПолноеИмяФайла;
		КонецЕсли;
		
		Объект.ИндексКартинки = РЭЙ_СлужебныйСервер.ПолучитьИндексПиктограммыФайла(Объект.Расширение);
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
		Объект.ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = Объект.ПолноеНаименование;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ФайлИзменен Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
		ТекущийОбъект.ФайлХранилище = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзмененСправочник_РЭЙ_Файлы");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	Если Объект.ТипХраненияФайла = ПредопределенноеЗначение("Перечисление.ТипыХраненияФайлов.ВИнформационнойБазе") Тогда
		Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
			текКаталог = КаталогВременныхФайлов() + ЭтаФорма.УникальныйИдентификатор ;
			СоздатьКаталог(текКаталог);
			текИмяФайла = текКаталог + "\" + Объект.ПолноеНаименование;
			ПолучитьФайл(ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ФайлХранилище"), текИмяФайла, Ложь);
			ЗапуститьПриложение(текИмяФайла);
		Иначе
			ПоказатьПредупреждение(, "Объект еще не записан.");
		КонецЕсли;
	Иначе
		ЗапуститьПриложение(Объект.ПутьКФайлу);
	КонецЕсли;
КонецПроцедуры
